---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceATOnDuctError
source: html/733742bd-e1fb-9c9c-b05d-f2d0947547f8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceATOnDuctError Property

The air terminal cannot be placed in an elevation or section view unless it is attached to a duct.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantPlaceATOnDuctError { get; }
```